export default {
  // API 接口请求优先，数据格式保持和 data 一致
  api: '',
  // api 为空则使用 data 静态数据 
  // 注意：图片请用 vh-img-flex 类包裹
  data: [
    // 动态模板示例：
    // {
    //   "date": "2025-06-30 12:00:00",
    //   "tags": [
    //     "心情",
    //     "生活"
    //   ],
    //   "content": "这里是动态内容文字"
    // },
    // 
    // 带图片的动态示例：
    // {
    //   "date": "2025-06-10 09:00:00",
    //   "tags": [
    //     "旅行"
    //   ],
    //   "content": "这里是带图片的动态内容<p class=\"vh-img-flex\"><img src=\"图片URL\"></p>"
    // }
  ]
}